Revit 2027 API
ParameterTypeId.RbsElecPanelMainstypeParam Property
 "Mains Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RbsElecPanelMainstypeParam { get; }
Public Shared ReadOnly Property RbsElecPanelMainstypeParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RbsElecPanelMainstypeParam {
	ForgeTypeId^ get ();
}
static member RbsElecPanelMainstypeParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace